/*Написать программу, которая на вход принимаетчисло и выдает его квадрат.(число умноженное на само себя)
*/
Console.Write("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());
int result = number * number;
Console.WriteLine(result);
